ry-ops/doomagotchi/pwn-node/sdkconfig.defaults
# pwn node — ESP32-S3 (M5Stack Cardputer Adv)
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# radio work on core 0, everything else core 1 (ADR 0002)
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# promiscuous capture: we only ever RX. No AP, no scan, no connect.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
